devdnl/dnx-rtos/src/system/drivers/ethmac/stm32f4/ethmac.c
/*=========================================================================*//**
@file    ethmac.c

@author  Daniel Zorychta

@brief   This driver support Ethernet interface.

@note    Copyright (C) 2017 Daniel Zorychta <daniel.zorychta@gmail.com>

         This program is free software; you can redistribute it and/or modify
         it under the terms of the GNU General Public License as published by
         the Free Software Foundation and modified by the dnx RTOS exception.

         NOTE: The modification  to the GPL is  included to allow you to
               distribute a combined work that includes dnx RTOS without
               being obliged to provide the source  code for proprietary
               components outside of the dnx RTOS.

         The dnx RTOS  is  distributed  in the hope  that  it will be useful,
         but WITHOUT  ANY  WARRANTY;  without  even  the implied  warranty of
         MERCHANTABILITY  or  FITNESS  FOR  A  PARTICULAR  PURPOSE.  See  the
         GNU General Public License for more details.

         Full license text is available on the following file: doc/license.txt.


*//*==========================================================================*/

/*==============================================================================
  Include files
==============================================================================*/
#include "drivers/driver.h"
#include "ethmac_cfg.h"
#include "ethmac_ioctl.h"
#include "stm32f4xx.h"
#include "stm32f4x7_eth.h"

/*==============================================================================
  Local macros
==============================================================================*/
#define INIT_TIMEOUT            2000
#define PHY_BSR_LINK_STATUS     (1 << 2)

/*==============================================================================
  Local object types
==============================================================================*/
struct ethmac {
        sem_t              *rx_data_ready;
        mutex_t            *rx_access;
        mutex_t            *tx_access;
        dev_lock_t          dev_lock;
        ETH_DMADESCTypeDef  DMA_tx_descriptor[ETHMAC_TXBUFNB];
        ETH_DMADESCTypeDef  DMA_rx_descriptor[ETHMAC_RXBUFNB];
        u8_t                tx_buffer[ETHMAC_TXBUFNB][ETH_MAX_PACKET_SIZE];
        u8_t                rx_buffer[ETHMAC_RXBUFNB][ETH_MAX_PACKET_SIZE];
};

/*==============================================================================
  Local function prototypes
==============================================================================*/
static bool   is_Ethernet_started       (void);
static void   send_packet               (size_t size);
static size_t wait_for_packet           (struct ethmac *hdl, uint32_t timeout);
static void   give_Rx_buffer_to_DMA     (void);
static bool   is_buffer_owned_by_DMA    (ETH_DMADESCTypeDef *DMA_descriptor);
static void   make_Rx_buffer_available  (void);
static u8_t  *get_buffer_address        (ETH_DMADESCTypeDef *DMA_descriptor);
static void   ETH_Stop                  (void);

/*==============================================================================
  Local objects
==============================================================================*/
MODULE_NAME(ETHMAC);

static struct ethmac *ethmac;

/*==============================================================================
  Exported objects
==============================================================================*/

/*==============================================================================
  External objects
==============================================================================*/
extern ETH_DMADESCTypeDef *DMARxDescToGet;
extern ETH_DMADESCTypeDef *DMATxDescToSet;

/*==============================================================================
  Function definitions
==============================================================================*/

//==============================================================================
/**
 * @brief Initialize device
 *
 * @param[out]          **device_handle        device allocated memory
 * @param[in ]            major                major device number
 * @param[in ]            minor                minor device number
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_INIT(ETHMAC, void **device_handle, u8_t major, u8_t minor)
{
        UNUSED_ARG2(major, minor);

        if (major != 0 || minor != 0) {
                return ENODEV;
        }

        int err = sys_zalloc(sizeof(struct ethmac), device_handle);
        if (!err) {
                struct ethmac *hdl = *device_handle;

                err = sys_semaphore_create(1, 0, &hdl->rx_data_ready);
                if (err != ESUCC)
                        goto finish;

                err = sys_mutex_create(MUTEX_TYPE_NORMAL, &hdl->rx_access);
                if (err != ESUCC)
                        goto finish;

                err = sys_mutex_create(MUTEX_TYPE_NORMAL, &hdl->tx_access);
                if (err != ESUCC)
                        goto finish;

                // reset Ethernet
                ETH_DeInit();
                ETH_SoftwareReset();

                u32_t timeout = sys_time_get_reference();
                while (  ETH_GetSoftwareResetStatus() == SET
                      && !sys_time_is_expired(timeout, INIT_TIMEOUT));

                if (sys_time_is_expired(timeout, INIT_TIMEOUT)) {
                        err = ETIME;
                        goto finish;
                }

                // enable interrupts
                SET_BIT(RCC->AHB1ENR, RCC_AHB1ENR_ETHMACRXEN | RCC_AHB1ENR_ETHMACTXEN | RCC_AHB1ENR_ETHMACEN);

                NVIC_EnableIRQ(ETH_IRQn);
                NVIC_SetPriority(ETH_IRQn, _CPU_IRQ_SAFE_PRIORITY_);

                /* MAC configuration */
                /*
                 * Ethernet DMA configuration
                 * When we use the Checksum offload feature, we need to enable the Store and Forward mode:
                 * the store and forward guarantee that a whole frame is stored in the FIFO, so the MAC can
                 * insert/verify the checksum, if the checksum is OK the DMA can handle the frame otherwise
                 * the frame is dropped
                 */
                ETH_InitTypeDef ETH_InitStructure;
                ETH_StructInit(&ETH_InitStructure);
                ETH_InitStructure.ETH_AutoNegotiation             = ETHMAC_PHY_AUTONEGOTIATION;
                ETH_InitStructure.ETH_LoopbackMode                = ETH_LoopbackMode_Disable;
                ETH_InitStructure.ETH_RetryTransmission           = ETH_RetryTransmission_Disable;
                ETH_InitStructure.ETH_AutomaticPadCRCStrip        = ETH_AutomaticPadCRCStrip_Disable;
                ETH_InitStructure.ETH_ReceiveAll                  = ETH_ReceiveAll_Disable;
                ETH_InitStructure.ETH_BroadcastFramesReception    = ETH_BroadcastFramesReception_Enable;
                ETH_InitStructure.ETH_PromiscuousMode             = ETH_PromiscuousMode_Disable;
                ETH_InitStructure.ETH_MulticastFramesFilter       = ETH_MulticastFramesFilter_Perfect;
                ETH_InitStructure.ETH_UnicastFramesFilter         = ETH_UnicastFramesFilter_Perfect;
                ETH_InitStructure.ETH_Speed                       = ETHMAC_SPEED;
                ETH_InitStructure.ETH_ChecksumOffload             = ETHMAC_CHECKSUM_BY_HARDWARE ? ETH_ChecksumOffload_Enable : 0;
                ETH_InitStructure.ETH_DropTCPIPChecksumErrorFrame = ETH_DropTCPIPChecksumErrorFrame_Enable;
                ETH_InitStructure.ETH_ReceiveStoreForward         = ETH_ReceiveStoreForward_Enable;
                ETH_InitStructure.ETH_TransmitStoreForward        = ETH_TransmitStoreForward_Enable;
                ETH_InitStructure.ETH_ForwardErrorFrames          = ETH_ForwardErrorFrames_Disable;
                ETH_InitStructure.ETH_ForwardUndersizedGoodFrames = ETH_ForwardUndersizedGoodFrames_Disable;
                ETH_InitStructure.ETH_SecondFrameOperate          = ETH_SecondFrameOperate_Enable;
                ETH_InitStructure.ETH_AddressAlignedBeats         = ETH_AddressAlignedBeats_Enable;
                ETH_InitStructure.ETH_FixedBurst                  = ETH_FixedBurst_Enable;
                ETH_InitStructure.ETH_RxDMABurstLength            = ETH_RxDMABurstLength_32Beat;
                ETH_InitStructure.ETH_TxDMABurstLength            = ETH_TxDMABurstLength_32Beat;
                ETH_InitStructure.ETH_DMAArbitration              = ETH_DMAArbitration_RoundRobin_RxTx_2_1;

                if (ETH_Init(&ETH_InitStructure, ETHMAC_PHY_ADDRESS)) {

                        ethmac = hdl;

                        ETH_DMAITConfig(ETH_DMA_IT_NIS | ETH_DMA_IT_R, ENABLE);

                        ETH_DMATxDescChainInit(ethmac->DMA_tx_descriptor,
                                               &ethmac->tx_buffer[0][0],
                                               ETHMAC_TXBUFNB);

                        ETH_DMARxDescChainInit(ethmac->DMA_rx_descriptor,
                                               &ethmac->rx_buffer[0][0],
                                               ETHMAC_RXBUFNB);

