devdnl/dnx-rtos/src/system/drivers/ethmac/stm32f4/ethmac.c
        case IOCTL_ETHMAC__ETHERNET_START:
                ETH_Start();
                return ESUCC;

        case IOCTL_ETHMAC__ETHERNET_STOP:
                ETH_Stop();
                return ESUCC;

        case IOCTL_ETHMAC__GET_LINK_STATUS:
                if (arg) {
                        ETHMAC_link_status_t *linkstat = cast(ETHMAC_link_status_t*, arg);

                        if (ETH_ReadPHYRegister(ETHMAC_PHY_ADDRESS, PHY_BSR) & PHY_BSR_LINK_STATUS) {
                                *linkstat = ETHMAC_LINK_STATUS__CONNECTED;
                        } else {
                                *linkstat = ETHMAC_LINK_STATUS__DISCONNECTED;
                        }

                        return ESUCC;
                } else {
                        return EINVAL;
                }

        default:
                return EBADRQC;
        }

        return err;
}

//==============================================================================
/**
 * @brief Flush device
 *
 * @param[in ]          *device_handle          device allocated memory
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_FLUSH(ETHMAC, void *device_handle)
{
        UNUSED_ARG1(device_handle);

        if (is_Ethernet_started()) {
                ETH_FlushTransmitFIFO();
        }

        return ESUCC;
}

//==============================================================================
/**
 * @brief Device information
 *
 * @param[in ]          *device_handle          device allocated memory
 * @param[out]          *device_stat            device status
 *
 * @return One of errno value (errno.h)
 */
//==============================================================================
API_MOD_STAT(ETHMAC, void *device_handle, struct vfs_dev_stat *device_stat)
{
        UNUSED_ARG1(device_handle);

        device_stat->st_size  = 0;
        device_stat->st_major = 0;
        device_stat->st_minor = 0;

        return ESUCC;
}

//==============================================================================
/**
 * @brief  Function check if ethernet interface is started
 * @param  None
 * @return If started then true is returned, otherwise false
 */
//==============================================================================
static bool is_Ethernet_started(void)
{
        return (ETH->MACCR & ETH_MACCR_TE) && (ETH->MACCR & ETH_MACCR_RE);
}

//==============================================================================
/**
 * @brief  Send packet from current Tx buffer
 * @param  size         packet size
 * @return None
 */
//==============================================================================
static void send_packet(size_t size)
{
        /* Setting the Frame Length: bits[12:0] */
        DMATxDescToSet->ControlBufferSize = (size & ETH_DMATxDesc_TBS1);

        /* Setting the last segment and first segment bits (in this case a frame is transmitted in one descriptor) */
        DMATxDescToSet->Status |= ETH_DMATxDesc_LS | ETH_DMATxDesc_FS;

        /* Set Own bit of the Tx descriptor Status: gives the buffer back to ETHERNET DMA */
        DMATxDescToSet->Status |= ETH_DMATxDesc_OWN;

        /* When Tx Buffer unavailable flag is set: clear it and resume transmission */
        if (ETH->DMASR & ETH_DMASR_TBUS) {
                /* Clear TBUS ETHERNET DMA flag */
                ETH->DMASR = ETH_DMASR_TBUS;

                /* Resume DMA transmission*/
                ETH->DMATPDR = 0;
        }

        /* Update the ETHERNET DMA global Tx descriptor with next Tx decriptor */
        /* Chained Mode */
        /* Selects the next DMA Tx descriptor list for next buffer to send */
        DMATxDescToSet = cast(ETH_DMADESCTypeDef*, DMATxDescToSet->Buffer2NextDescAddr);

        // FIXME This workaround fixes problems with packets lags...
        //       The problem is visible only when a lot of data is send
        //       and many packets are generated.
        if (size > 1460) {
                sys_sleep_ms(1);
        }
}

//==============================================================================
/**
 * @brief  Function waits for a packet and return a size of recived packet
 * @param  hdl          driver context
 * @param  timeout      packet wait timeout
 * @return Size of received packet
 */
//==============================================================================
static size_t wait_for_packet(struct ethmac *hdl, uint32_t timeout)
{
        size_t size = 0;

        if (!is_buffer_owned_by_DMA(DMARxDescToGet)) {
                sys_semaphore_wait(hdl->rx_data_ready, 0);
                size = ETH_GetRxPktSize(DMARxDescToGet);

        } else {
                if (sys_semaphore_wait(hdl->rx_data_ready, timeout) == ESUCC) {
                        if (!is_buffer_owned_by_DMA(DMARxDescToGet)) {
                                size = ETH_GetRxPktSize(DMARxDescToGet);
                        }
                }
        }

        return size;
}

//==============================================================================
/**
 * @brief  Give a current read buffer to the DMA controller
 * @param  None
 * @return None
 */
//==============================================================================
static void give_Rx_buffer_to_DMA(void)
{
        /* Set Own bit of the Rx descriptor Status: gives the buffer back to ETHERNET DMA */
        DMARxDescToGet->Status = ETH_DMARxDesc_OWN;

        /* Update the ETHERNET DMA global Rx descriptor with next Rx descriptor */
        /* Selects the next DMA Rx descriptor list for next buffer to read */
        DMARxDescToGet = cast(ETH_DMADESCTypeDef*, DMARxDescToGet->Buffer2NextDescAddr);
}

//==============================================================================
/**
 * @brief  Function checks if buffer is owned by the DMA controller
 * @param  DMA_descriptor       DMA descriptor (Rx or Tx)
 * @return If buffer is owned the true is returned, otherwise false
 */
//==============================================================================
static bool is_buffer_owned_by_DMA(ETH_DMADESCTypeDef *DMA_descriptor)
{
        return DMA_descriptor->Status & ETH_DMARxDesc_OWN; // ETH_DMATxDesc_OWN
}

//==============================================================================
/**
 * @brief  Function makes Rx buffer available for the DMA controller and resume packet reception
 * @param  None
 * @return None
 */
//==============================================================================
static void make_Rx_buffer_available(void)
{
        if (ETH->DMASR & ETH_DMASR_RBUS) {
                ETH_DMAClearFlag(ETH_DMA_FLAG_RBU);
                ETH_ResumeDMAReception();
        }
}

//==============================================================================
/**
 * @brief  Function returns buffer address of a selected DMA descriptor
 * @param  DMA_descriptor       DMA descriptor
 * @return Buffer address of selected DMA
 */
//==============================================================================
static u8_t *get_buffer_address(ETH_DMADESCTypeDef *DMA_descriptor)
{
        return cast(u8_t*, DMA_descriptor->Buffer1Addr);
}

//==============================================================================
/**
 * @brief  Function stops Ethernet interface (opposition function to ETH_Start())
 * @param  None
 * @return None
 */
//==============================================================================
static void ETH_Stop(void)
{
        /* Enable transmit state machine of the MAC for transmission on the MII */
        ETH_MACTransmissionCmd(DISABLE);
        /* Flush Transmit FIFO */
        ETH_FlushTransmitFIFO();
        /* Enable receive state machine of the MAC for reception from the MII */
        ETH_MACReceptionCmd(DISABLE);

        /* Start DMA transmission */
        ETH_DMATransmissionCmd(DISABLE);
        /* Start DMA reception */
        ETH_DMAReceptionCmd(DISABLE);
}

//==============================================================================
/**
 * @brief  Ethernet interrupt
 * @param  None
 * @return None
 */
//==============================================================================
void ETH_IRQHandler(void)
{
        if (ETH_GetDMAFlagStatus(ETH_DMA_FLAG_R)) {

                bool woken = false;
                sys_semaphore_signal_from_ISR(ethmac->rx_data_ready, &woken);

                ETH_DMAClearITPendingBit(ETH_DMA_IT_NIS | ETH_DMA_IT_R);

                sys_thread_yield_from_ISR(woken);
        }
}

/*==============================================================================
  End of file
==============================================================================*/
